5.2 데이터 불러오기

가. DataFrame과 데이터 파일 불러오기

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data/EX_GrapeData.csv')
df.head()

   continent  brand  size  period price
0          2      2  10.7   47.65   144
1          2      3  14.0   63.13   215
2          2      2   9.0   58.76   105
3          1      1   8.0   34.88    69
4          2      2  10.0   55.53   134

In [3]:
df = pd.read_excel('../data/EX_GrapeData.xlsx', engine='openpyxl')
df.head()

   continent  brand  size  period  price
0        2.0    2.0  10.7   47.65  144.0
1        2.0    3.0  14.0   63.13  215.0
2        2.0    2.0   9.0   58.76  105.0
3        1.0    1.0   8.0   34.88   69.0
4        2.0    2.0  10.0   55.53  134.0

In [4]:
# DataFrame
df_price = df[['price']]
print(f"type of df_price: {type(df_price)}")
df_price

type of df_price: <class 'pandas.core.frame.DataFrame'>

    price
0   144.0
1   215.0
2   105.0
3    69.0
4   134.0
..    ...
58   21.5
59    NaN
60    NaN
61    NaN
62    NaN

[63 rows x 1 columns]

In [5]:
# Series
df_price = df['price']
print(f"type of df_price: {type(df_price)}")
df_price

type of df_price: <class 'pandas.core.series.Series'>

0     144.0
1     215.0
2     105.0
3      69.0
4     134.0
      ...
58     21.5
59      NaN
60      NaN
61      NaN
62      NaN
Name: price, Length: 63, dtype: float64

In [6]:
# DataFrame
df_price = df[df.columns[[3]]]
print(f"type of df_price: {type(df_price)}")
df_price

type of df_price: <class 'pandas.core.frame.DataFrame'>

    period
0    47.65
1    63.13
2    58.76
3    34.88
4    55.53
..     ...
58   16.66
59   43.00
60   12.00
61   20.00
62   19.00

[63 rows x 1 columns]

In [7]:
# Serise
df_price = df[df.columns[3]]
print(f"type of df_price: {type(df_price)}")
df_price

type of df_price: <class 'pandas.core.series.Series'>

0     47.65
1     63.13
2     58.76
3     34.88
4     55.53
      ...
58    16.66
59    43.00
60    12.00
61    20.00
62    19.00
Name: period, Length: 63, dtype: float64

5.3 데이터 변환하기

가. 복사, 추가, 삭제

나. 변수이름 변경, 행추가 및 삭제

In [8]:
# rename
df_colums = df.copy()
df_colums = df_colums[['size', 'period', 'price']]
print(type(df_colums))
print(f"before: {df_colums.columns}")

df_colums.rename(columns={'period': 'time'}, inplace=True)
print(f"after: {df_colums.columns}")

<class 'pandas.core.frame.DataFrame'>
before: Index(['size', 'period', 'price'], dtype='object')
after: Index(['size', 'time', 'price'], dtype='object')

In [9]:
df_colums.head()

   size   time  price
0  10.7  47.65  144.0
1  14.0  63.13  215.0
2   9.0  58.76  105.0
3   8.0  34.88   69.0
4  10.0  55.53  134.0

In [10]:
# add column
df_colums['growth'] = df_colums['size'] / df_colums['time']
df_colums.head()

   size   time  price    growth
0  10.7  47.65  144.0  0.224554
1  14.0  63.13  215.0  0.221765
2   9.0  58.76  105.0  0.153165
3   8.0  34.88   69.0  0.229358
4  10.0  55.53  134.0  0.180083

다. 데이터 케이스 추출

In [11]:
df_continent_brand = df[(df['continent'] == 1) & (df['brand'] == 1)]
print(type(df_continent_brand))
df_continent_brand.head()

<class 'pandas.core.frame.DataFrame'>

    continent  brand  size  period  price
3         1.0    1.0   8.0   34.88   69.0
11        1.0    1.0  10.4   17.67   54.0
12        1.0    1.0   7.4   16.41   39.0
13        1.0    1.0   5.4   12.02   29.5
16        1.0    1.0   6.0   23.21   42.0

In [12]:
df_over_size_period = df[(df['size'] >= 10) & (df['period'] >= 30)]
df_over_size_period.head()

   continent  brand  size  period  price
0        2.0    2.0  10.7   47.65  144.0
1        2.0    3.0  14.0   63.13  215.0
4        2.0    2.0  10.0   55.53  134.0
5        2.0    2.0  10.5   43.14  129.0
6        2.0    2.0  16.0   54.86  155.0

라. 코딩변경

In [13]:
df['brand'].value_counts()

2.0    24
1.0    23
3.0    16
Name: brand, dtype: int64

In [14]:
# replace
recode_brand = {'brand': {1: 1, 2: 1, 3: 2}}
df_recode1 = df.replace(recode_brand)
df_recode1.head()

   continent  brand  size  period  price
0        2.0    1.0  10.7   47.65  144.0
1        2.0    2.0  14.0   63.13  215.0
2        2.0    1.0   9.0   58.76  105.0
3        1.0    1.0   8.0   34.88   69.0
4        2.0    1.0  10.0   55.53  134.0

In [15]:
df_recode1['brand'].value_counts()

1.0    47
2.0    16
Name: brand, dtype: int64

In [16]:
df_test = df.copy()
df_test['brand'][df_test['brand'] == 2] = 1
df_test['brand'][df_test['brand'] == 3] = 2
df_test.head()

   continent  brand  size  period  price
0        2.0    1.0  10.7   47.65  144.0
1        2.0    2.0  14.0   63.13  215.0
2        2.0    1.0   9.0   58.76  105.0
3        1.0    1.0   8.0   34.88   69.0
4        2.0    1.0  10.0   55.53  134.0

In [17]:
df_test['brand'].value_counts()

1.0    47
2.0    16
Name: brand, dtype: int64

In [18]:
# function
def brand_groups(series):
    if series == 1:
        return 1
    elif series == 2:
        return 1
    elif series == 3:
        return 2


df_recode2 = df.copy()
df_recode2['re_brand'] = df_recode2['brand'].apply(brand_groups)
df_recode2.head()

   continent  brand  size  period  price  re_brand
0        2.0    2.0  10.7   47.65  144.0         1
1        2.0    3.0  14.0   63.13  215.0         2
2        2.0    2.0   9.0   58.76  105.0         1
3        1.0    1.0   8.0   34.88   69.0         1
4        2.0    2.0  10.0   55.53  134.0         1

In [19]:
df_recode3 = df.copy()
df_recode3['brand'] = df_recode3['brand'].apply(brand_groups)
df_recode3.head()

   continent  brand  size  period  price
0        2.0      1  10.7   47.65  144.0
1        2.0      2  14.0   63.13  215.0
2        2.0      1   9.0   58.76  105.0
3        1.0      1   8.0   34.88   69.0
4        2.0      1  10.0   55.53  134.0

In [46]:
# sort values
import numpy as np

df_sort = df.copy()

test = np.arange(63, 0, -1)
pd.DataFrame(test).head()

df_sort['test'] = test
print(df_sort.head())

df_sort = df_sort.sort_values(by='test')
print(df_sort.head())

df_sort = df_sort.sort_values(by='period')
print(df_sort.head())

df_sort = df_sort.sort_values(by=['brand', 'test'])
print(df_sort.head())

   continent  brand  size  period  price  test
0        2.0    2.0  10.7   47.65  144.0    63
1        2.0    3.0  14.0   63.13  215.0    62
2        2.0    2.0   9.0   58.76  105.0    61
3        1.0    1.0   8.0   34.88   69.0    60
4        2.0    2.0  10.0   55.53  134.0    59
    continent  brand  size  period  price  test
62        2.0    3.0  31.0   19.00    NaN     1
61        2.0    3.0  13.0   20.00    NaN     2
60        2.0    2.0   5.0   12.00    NaN     3
59        2.0    1.0  21.0   43.00    NaN     4
58        1.0    1.0   5.0   16.66   21.5     5
    continent  brand  size  period  price  test
60        2.0    2.0   5.0   12.00    NaN     3
13        1.0    1.0   5.4   12.02   29.5    50
26        1.0    2.0   6.0   13.25   31.0    37
25        1.0    1.0   5.5   15.61   30.0    38
12        1.0    1.0   7.4   16.41   39.0    51
    continent  brand  size  period  price  test
59        2.0    1.0  21.0   43.00    NaN     4
58        1.0    1.0   5.0   16.66   21.5     5
54        1.0    1.0   6.0   20.85   24.5     9
53        1.0    1.0   8.5   30.20   54.5    10
48        2.0    1.0   7.5   20.83   23.0    15